[{"title": "GOP Debate Viewership Tumbles 25% From First Event", "date": "2023-09-28", "content": "Share to FacebookShare to TwitterShare to LinkedinTopline\nThe second Republican presidential debate of the year raked in 9.8 million viewers Wednesday night, according to Nielsen, a sharp drop off from the first debate that took place in late August, which beat expectations with 12.8 million viewers to become the most-watched political faceoff since 2020.\nSeven presidential candidates attended the second Republican presidential primary debate. (Photo by ... [+] PEDRO UGARTE / AFP) (Photo by PEDRO UGARTE/AFP via Getty Images)AFP via Getty Images\n\nKey Facts\n\n\nThe broadcast was aired on three different channels—Fox News, which brought in 6.7 million viewers, Fox Business (1.8 million) and Univision (813,000).\n\n\n\nThe debate, which featured heated exchanges and name calling from seven Republican presidential candidates, was not attended by former President Donald Trump, who instead spent time blasting electric cars at an auto worker rally in Michigan.\n\n\n\n\nThe debate drew nearly 2 million viewers from the 25-54 year old age range, a key demographic group.\n\n\n\nNo other program on cable or network television attracted as many viewers as the debate did Thursday night.\n\n\n\n\nKey Background\nTrump’s absence from the debate was a topic touched on by participating candidates including former New Jersey Gov. Chris Christie and Florida Gov. Ron DeSantis. Christie said Trump was afraid of defending his record and being on stage before referring to the former president as “Donald Duck” for avoiding the debate. Trump also decided to skip out on the first debate in August. A Tucker Carlson-hosted interview with the former president was posted around the same time the first debate aired. Trump took the opportunity to explain his reasons for skipping out on the debate, saying it was useless to do so because he was leading his competitors in the polls and didn’t want to be pressed by people who “shouldn’t even be running for president.”\n\nFurther Reading\n5 Takeaways From Last Night’s GOP Debate—Trump Skips, Ramaswamy Spars And Christie Name-Drops ‘Donald Duck’ (Forbes)\n\n‘They’re Gutless’: Trump Blasts Car Companies Over EV Pivot In Debate Counterprogramming Speech (Forbes)\nFollow me on Twitter or LinkedIn. Send me a secure tip. Antonio Pequeño IVEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/antoniopequenoiv/2023/09/28/gop-debate-viewership-tumbles-25-from-first-event/"}, {"title": "Could Menendez Be Expelled From Senate? Here’s What The Process Would Look Like", "date": "2023-09-28", "content": "Share to FacebookShare to TwitterShare to LinkedinTopline\nSen. John Fetterman (D-Pa.) said Thursday he would vote to expel Sen. Bob Menendez (D-N.J.), who has refused to step down and maintained his innocence following a federal indictment on bribery charges—despite many of his Democratic colleagues calling for his resignation.\nSen. Bob Menendez (D-NJ) said he would not resign and will serve out his term following a federal ... [+] indictment at a press conference at Hudson County Community College’s North Hudson Campus on September 25, 2023 in Union City, New Jersey. (Photo by Michael M. Santiago/Getty Images)Getty Images\n\nKey Facts\n\n\nWhen Fetterman was asked by reporters if he would introduce a resolution to expel Menendez, he said, “whatever kinds of procedure that could bring about getting rid of him, I’m all for it, forcing it,” the Hill reported; and when he asked if he would vote for a measure to expel Menendez, Fetterman said “of course I would vote for that.”\n\n\n\nThe Constitution states the House and Senate “may determine the Rules of its proceedings, punish its members for disorderly behavior, and … expel a member” with a two-thirds vote.\n\n\n\nBased on precedent, the expulsion process would most likely begin with an investigation by the Senate Ethics Committee that would result in a recommendation to expel or not, and then a vote.\n\n\n\n\nHowever, another Senator could simply introduce a resolution to expel on the Senate floor, which would then be tabled, voted on or referred to the ethics committee.\n\n\nThe Senate has considered expulsion 30 times, but only 15 of those actually resulted in expulsion; in the other half of the cases the senator either resigned, was exonerated or their term expired.\n\n\nSince 1982, Congress has only considered expelling two senators—one for corruption and one for sexual misconduct—but both resigned before a vote occurred.\n\n\n\n\nContra\nThough a legal possibility, an expulsion doesn’t yet appear likely for Menendez. As of Thursday evening, Fetterman is the only Democrat to say he would move to expel Menendez, and Senate Majority Leader Chuck Schumer (D-N.Y.) hasn’t called for Menendez to resign. He also has the support of many Republicans—which would make getting two-thirds vote more difficult—who are highlighting the fact that he is innocent until proven guilty, in what may be a move of political maneuvering to hurt Democrats. Sen. Tom Cotton (R-Ark.) tweeted Tuesday that while the charges are “serious and troubling,” Menendez “has a right to test the government’s evidence in court, just like any other citizen. He should be judged by jurors and New Jersey’s voters, not by Democratic politicians who now view him as inconvenient to their hold on power.”\nBig Number\n14. That’s how many of the 15 Senate expulsions since 1789 were related to the Civil War and representatives having support for the Confederate rebellion.\n\nKey Background\nMenendez and his wife were indicted last Friday on charges of conspiracy to commit bribery, conspiracy to commit extortion under color of official right and conspiracy to commit honest services fraud. They are accused of accepting hundreds of thousands of dollars in bribes in the form of cash, gold bars and a luxury car in exchange for favors from three New Jersey businessmen. In 2015, Menendez was indicted on bribery charges related to a Florida ophthalmologist who reportedly gave him $1 million in gifts and campaign donations in exchange for political influence, but his trial ended in a hung jury and the charges against him were dismissed. Menendez has continued to deny the new allegations against him and resisted calls to resign, saying that “for years, forces behind the scenes have repeatedly attempted to silence my voice and dig my political grave,” and calling the investigation “an active smear campaign.”\n\nFurther ReadingThe HillFetterman says he would vote to expel Menendez from the SenateNytimesMenendez Rejects Democrats' Calls to Resign, Prompting Talk of Expulsion\nFollow me on Twitter. Send me a secure tip. Molly BohannonEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/mollybohannon/2023/09/28/could-menendez-be-expelled-from-senate-heres-what-the-process-would-look-like/"}, {"title": "Trump Reverses Course: Won’t Try Moving His Georgia Case To Federal Court", "date": "2023-09-28", "content": "Updated Sep 28, 2023, 07:02pm EDTShare to FacebookShare to TwitterShare to LinkedinTopline\nFormer President Donald Trump will no longer seek to have his Georgia election interference case moved to federal court, opening up the former president to a televised criminal trial, a less favorable jury and the chance to pardon himself if he’s convicted after being reelected.\nTrump was booked in August on multiple charges related to an alleged plan to overturn the results of ... [+] the 2020 presidential election in Georgia. (Photo by Joe Raedle/Getty Images)Getty Images\n\nKey Facts\n\n\nTrump’s attorneys notified a Fulton County court of the decision, according to multiple reports, which reported a filing that said the former president’s decision is based on “well-founded confidence” that the court will provide him with a fair trial and due process throughout the prosecution of the case.\n\n\n\nTrump notified the Fulton County court last month that he may file to move the case to federal court, a move the filing said was done \"in an abundance of caution,” ABC reported.\n\n\n\n\nThe former president’s decision means he will be in televised and livestreamed court proceedings for his Georgia election interference case, which does not yet have a trial date.\n\n\n\nTrump, alongside 18 co-defendants, has pleaded not guilty to his charges.\n\n\nA representative for Trump did not immediately respond to Forbes’ request for comment.\n\n\n\n\nKey Background\nTrump was indicted on 13 felony counts in Georgia that include conspiracy to commit impersonating a public officer, forgery conspiracy and a RICO violation. Georgia’s RICO statute prohibits racketeering or conspiring to do so and is punishable by a fine and/or imprisonment between five and 20 years. A total of 41 counts were brought against 19 defendants in the election interference case. One of those defendants, Mark Meadows, attempted to move his case to federal court but was denied by U.S. District Court Judge Steve Jones, who said Meadows failed to meet the “quite low” threshold needed to move the case out of Georgia. Trump faces three other indictments outside of his Georgia case, with his nearest trial date set for March 4 of next year for his federal election interference case brought forth by Justice Department Special Counsel Jack Smith.\n\n\nFurther Reading\nTrump Indicted In Georgia: Here Are The Crimes He’s Been Charged With—And The Prison Sentences They Carry (Forbes)\nJudge Denies Mark Meadows’ Request To Move Georgia Election Interference Case To Federal Court (Forbes)\nFollow me on Twitter or LinkedIn. Send me a secure tip. Antonio Pequeño IVEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/antoniopequenoiv/2023/09/28/trump-reverses-course-wont-move-his-georgia-case-to-federal-court/"}, {"title": "PGA Attracting Red Sox And WWE Owners As Possible Alternative To Saudi Investment", "date": "2023-09-28", "content": "Share to FacebookShare to TwitterShare to LinkedinTopline\nA group including Endeavor Group Holdings (owner of the WWE) and Fenway Sports Group (owner of the Boston Red Sox) is in the preliminary stages of potentially investing in the PGA Tour, providing the golf association with an alternative to its pending deal with Saudi Arabia’s Public Investment Fund and LIV Golf, a source familiar with the situation told Forbes.\nA general view of the PGA Tour logo during the PGA - Travelers Championship at TPC River Highlands ... [+] on June 21, 2023 in Cromwell, Connecticut. (Photo by Rich Graessle/Icon Sportswire via Getty Images)Icon Sportswire via Getty Images\n\nKey Facts\n\n\nThe deal, which also includes KKR & Co. co-founder Henry Kravis, could provide the PGA Tour with an alternative option to the controversial deal it made in June to merge with Saudi Arabia-backed LIV Golf, the source said.\n\n\n\nThis could happen in the event that U.S. regulators strike down the deal or the players vote it down.\n\n\n\nForbes reported Wednesday that the PGA Tour was looking for U.S. investors as a backup in case the merger falls through.\n\n\n\n\nThis potential investment could also allow the PGA Tour to simply reject the LIV Golf merger deal, though a spokesperson for the tour told Forbes its “focus continues to be on finalizing an agreement with the Public Investment Fund and the DP World Tour,” but also noted that they’d received “unsolicited” offers.\n\n\nThe investment could also happen even if the merger goes through, and the source emphasized that negotiations are still early and the deal could evolve in a number of ways.\n\n\nForbes has reached out to Endeavor Group Holdings and Fenway Sports Group for comment; Bloomberg first reported the news Thursday.\n\n\n\n\nKey Background\nWith billions of dollars from the Saudi government-controlled Public Investment Fund, LIV Golf emerged as a direct competitor to the PGA Tour in 2022. Using that money, the golf startup was able to lure some of the PGA Tour’s best-known golfers, including Phil Mickelson and Dustin Johnson, kicking off a messy legal fight between the two. Eventually, the PGA Tour forbade its golfers from participating in LIV Golf events, forcing players to pick between the two. Throughout it all, LIV Golf was accused of being a “sportswashing” operation by the Saudi government, which critics argued was using the golf league to distract from its human rights abuses. This came to an end in June when the two suddenly announced a merger. That deal has been heavily scrutinized, including by politicians in Washington. Sen. Richard Blumenthal (D-Conn.) told a group of PGA executives the deal gives the Saudi government “financial dominance” because they “control the purse strings” during a hearing in July.\n\nTangent\nThis also appears to be an attempt by Endeavor and Fenway to expand their portfolios in the sports industry. Endeavor, which is based in Beverly Hills, California, just completed its takeover of the popular wrestling label WWE. And Fenway Sports Group, which is run in part by founder John Henry, is based in Boston and commands a massive sports portfolio, owning properties like Liverpool FC, New England Sports Network and Nascar's Roush Fenway Racing, in addition to its marquee team: the Boston Red Sox. A deal with the PGA Tour would add to its burgeoning golf investments. It was a partner in the PGA Tour’s Deutsche Bank Championship, and in August partnered with the Ladies Professional Golf Association. It also invested in TMRW Sports, which is launching a new Tiger Woods-backed golf league called TGL, and owns the TGL Boston team.\nForbes Valuation\nWe estimate Fenway Sports Group Founder John Henry to be worth $5.1 billion, and we estimate KKR & Co. co-founder Henry Kravis to be worth $8.9 billion.\n\nFurther Reading\nHenry Kravis, Endeavor, Fenway Eye PGA Tour Deal to Rival Saudi Arabia’s (Bloomberg)\nPGA Tour And Saudi-Backed LIV Golf Agree To Sudden Merger (Forbes)\nThe PGA Tour Wants U.S. Money As Insurance For Opposition Of Saudi LIV Golf Takeover (Forbes)\nSaudi Public Investment Fund Reports $11 Billion In 2022 Losses—But Sports Investments Might Not Be To Blame (Forbes)\nTiger Woods Joins PGA Tour Board Ahead Of Saudi Merger—Expresses Confidence In Maligned PGA Commissioner Jay Monahan (Forbes)\nFollow me on Twitter or LinkedIn. Send me a secure tip. William SkipworthEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/willskipworth/2023/09/28/pga-attracting-red-sox-and-wwe-owners-as-possible-alternative-to-saudi-investment/"}, {"title": "Beyoncé’s Renaissance World Tour Shatters Record For Highest-Grossing Month, Report Says", "date": "2023-09-28", "content": "Share to FacebookShare to TwitterShare to LinkedinTopline\nSinger Beyoncé’s world tour raked in $179 million in a single month, according to Billboard, far surpassing a previous monthly record set by her and setting the stage for her to join the likes of Coldplay and Rolling Stone on the list of artists with the highest-grossing tours.\nBeyoncé's Renaissance World Tour is reportedly the highest-grossing tour by a woman. (Photo by Kevin ... [+] Mazur/WireImage for Parkwood)WireImage for Parkwood\n\nKey Facts\n\n\nIn August, Beyoncé’s Renaissance World Tour grossed $179.3 million, making it the highest one-month gross for tours since Billboard began tracking tour earnings through Boxscore—its touring data tracker and live acts ranking charts—in 1985.\n\n\n\nBeyoncé’s Renaissance World Tour also owned the previous record: $127.6 million set in July.\n\n\n\nBillboard deemed the tour “the highest grossing tour by a woman in the Boxscore archives,” as it has grossed a reported $461.3 million to date.\n\n\n\n\nHaving done nearly 60 shows since kicking off in the spring and concluding the tour with one more show in Kansas City on October 1, Billboard estimates the Renaissance World Tour will gross about $560 million and rank among the highest-grossing tours of all-time.\n\n\nShould estimates be actualized, Beyoncé will be the only woman, only Black person and only American solo act on the top 10 list, and outperforming acts like Roger Waters and the Rolling Stones.\n\n\nBeyoncé’s Renaissance World Tour surpassed Madonna’s 2008-09 Sticky & Sweet tour to become the highest-grossing tour for a woman in history, according to Billboard, with only tours from Guns N’ Roses, Coldplay, Harry Styles, Ed Sheeran and Elton John making more money.\n\n\n\n\nForbes Valuation\nWe estimate Beyoncé’s net worth to be $540 million and rank her among the top 50 of America’s richest self-made women.\n\nKey Background\nThe Renaissance World Tour kicked off in Europe in May after tickets went on sale at the beginning of February. Then, Billboard estimated the tour could gross between $275 million and $428 million. This was Beyoncé’s first solo tour since 2016 and followed the release of her Grammy-winning album Renaissance in July 2022.\nTangent\nHaving the highest-grossing tour by a woman is one of many “firsts” or “mosts” Beyoncé has added in relation to Renaissance. At this year’s Grammy awards, she became the most awarded artist in Grammy history, thanks to the Renaissance album’s four wins. When the album debuted at No.1, Beyoncé became the first female artist to have seven albums debut at the top of the chart.\n\nFurther Title\nBeyoncé Re-Sets Monthly Boxscore Record With $179 Million in August  (Billboard)\nTaylor Swift vs Beyoncé: How These Super Stars Stack Up Against One Another (Forbes)\nFollow me on LinkedIn. Send me a secure tip. Darreonna DavisEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/darreonnadavis/2023/09/28/beyoncs-renaissance-world-tour-shatters-record-for-highest-grossing-month-report-says/"}, {"title": "California City Becomes First To Legalize Rights Of Elephants", "date": "2023-09-28", "content": "Share to FacebookShare to TwitterShare to LinkedinTopline\nOjai, a city in southern California, passed an ordinance this week to become the first city in the nation to recognize the legal rights of a nonhuman animal: the elephant.\nThe legislation was sparked by an elephant who was used for entertainment purposes in the 1980s in ... [+] Ojai.Ezra Acayan/Getty\n\nKey Facts\n\n\nThe Ojai City Council passed an ordinance Tuesday that defines and protects elephants’ right to liberty and prevents any person from stopping elephants from exercising their right to liberty.\n\n\n\nThe ordinance was developed by a council member and the Nonhuman Rights Project, a nonprofit organization that develops legislation and takes legal action to advocate for the rights of animals they believe belong out of captivity.\n\n\n\n\nThe 4-1 vote means elephants in Ojai cannot be held captive unless the space is comparable to an accredited sanctuary.\n\n\n\nThere are no zoos or sanctuaries in Ojai currently.\n\n\n\n\nKey Background\nThe unusual legislation is the result of an elephant who was used for entertainment in the 1980’s in the southern Californian city. An elephant named Tarra was used to entertain people in the 1980’s, including in an act where she rode roller skates, according to the Nonhuman Rights Project. Years later, in 1995, she was moved to The Elephant Sanctuary in Tennessee and became its first resident.\nTangent\nThe Nonhuman Rights Project is working at the state and county level to “demand recognition of the legal personhood and fundamental right to bodily liberty” of a number of species including great apes, elephants, dolphins and whales that the nonprofit says are held in captivity throughout the U.S. Jane Goodall is among the members of the organization’s board working toward that goal. Earlier this summer, for example, the nonprofit filed a petition in Colorado arguing that five elephants housed at the Cheyenne Mountain Zoo in Colorado Springs, Colorado, had the right to liberty and should be released to a sanctuary.\n\nCrucial Quote\nCourtney Fern, Director of Government Relations for the Nonhuman Rights Project, called the legislation “historic,” adding that “it’s indisputable that elephants suffer when deprived of their freedom and that animal welfare laws can’t end their suffering.”\nChief Critic\nJustin Barker, a political analyst focused on animal and wildlife-related laws, told the California Globe the “Ojai law is kind of crazy and is only inviting someone to bring an elephant there and directly challenge it.” Barker compared the Ojai ordinance to lawsuits in the early 90s to protect spotted owls in the Pacific Northwest. A federal court ruling in 1991 closed some parts of the Northwest woods to logging; Barker said loggers who were not happy about the ruling responded in “borderline legal ways” like physically moving the birds. He suggested something similar could happen in Ojai.\nWhat We Don’t Know\nWhile the ordinance says that law enforcement officers can enforce the legislation, it’s unclear exactly what the penalty against violators would be.\n\nFurther Reading\nOjai, CA Becomes First U.S. City To Recognize Legal Rights Of Elephants (California Globe)\nSend me a secure tip. Ana FaguyEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/anafaguy/2023/09/28/california-city-becomes-first-to-legalize-rights-of-elephants/"}, {"title": "Nvidia’s French Offices Raided Over Antitrust Concerns, Report Says", "date": "2023-09-28", "content": "Share to FacebookShare to TwitterShare to LinkedinTopline\nFrance’s antitrust authority raided Nvidia’s French offices this week over suspicion the tech giant engaged in anticompetitive practices, according to the Wall Street Journal, which cited people familiar with the raid who identified Nvidia as the raid’s subject despite the authority not disclosing what entity it targeted.\nNvidia is the leading producer of chip technology. (Photo by Jakub Porzycki/NurPhoto via Getty ... [+] Images)NurPhoto via Getty Images\n\nKey Facts\n\n\nThe French competition authority disclosed the raid Wednesday but did not share what business practice or company was being specifically investigated—though it did disclose the company was in the “graphics cards sector,” according to the Journal.\n\n\n\nA judge approved the raid—an operation that followed up a larger inquiry into the cloud-computing sector conducted by the competition authority, which cited concerns that companies in the sector could use their computing resources to shut out other competitors, the Journal reported.\n\n\n\n\nA June competition authority report says competition regulators will need to make sure larger players in the cloud technology sector don’t stymie the development of smaller competitors.\n\n\n\nNvidia declined to provide comment to Forbes.\n\n\n\n\nBig Number\n$1 trillion. That’s Nvidia’s market capitalization as of Thursday, a massive jump from the $369 billion market cap it boasted in January.\nTangent\nNvidia’s share price closed up more than 1% on Thursday, at $430.89. The company’s stock is up around 200% since the start of the year, when it was trading around $143 per share.\nKey Background\nNvidia is the largest producer of chip technology used on game consoles, computers and generative AI. Other tech giants such as Microsoft, Google, Facebook and Amazon are some of Nvidia’s biggest customers and have been for several years, with generative AI becoming one of the main reasons the companies purchase hardware from the chip maker. Nvidia shattered Wall Street expectations in its recent earnings report, raking in $13.5 billion in sales and $2.45 in earnings per share last quarter. Nvidia expects $16 billion in sales during the current quarter, according to its latest earnings report.\n\n\nFurther Reading\nNvidia’s French Offices Raided in Cloud-Computing Competition Inquiry (WSJ)\nNvidia Earnings: Stock Soars As AI Giant Again Smashes Quarterly Expectations (Forbes)\nFollow me on Twitter or LinkedIn. Send me a secure tip. Antonio Pequeño IVEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/antoniopequenoiv/2023/09/28/nvidias-french-offices-raided-over-antitrust-concerns-report-says/"}, {"title": "Glenn Youngkin Buzz: Here’s Why Everyone Is Suddenly Talking About The Virginia Governor As A Trump Challenger", "date": "2023-09-28", "content": "Updated Sep 28, 2023, 05:03pm EDTShare to FacebookShare to TwitterShare to LinkedinTopline\nBig money GOP donors are increasingly turning to Virginia’s Republican Gov. Glenn Youngkin as a 2024 alternative to former President Donald Trump, according to a Washington Post opinion piece by journalist Robert Costa, as a cast of GOP candidates continue to slump in the polls and as Youngkin emerges in the national spotlight as a rumored 2024 candidate and occasional Trump antagonist.\nVirginia Governor Glenn Youngkin at George Mason University in May.Getty Images\n\nKey Facts\n\n\nYoungkin hasn't formally thrown his hat in the ring and has shrugged off previous calls for him to run for president, but a group of GOP donors are strategizing behind the scenes to draft him in 2024, with meetings planned in the coming weeks, Costa reported in the Post.\n\n\n\nA Harvard University graduate and former co-CEO of investment firm the Carlyle Group whose net worth Forbes estimated at $470 million in 2021, Youngkin entered Virginia politics in January 2021 when he announced his gubernatorial campaign.\n\n\n\n\nHe spent $5.5 million of his own money and ultimately defeated former Virginia Democrat Gov. Terry McAuliffe with 50.6% of the vote—a major win for Republicans that placed Youngkin in the national spotlight, one year after Trump lost Virginia by 10 points.\n\n\n\nYoungkin, who cannot run for reelection immediately after his gubernatorial term ends in 2026, campaigned as a self-proclaimed “political outsider with proven business experience,” drawing parallels to Trump’s 2016 campaign and winning Trump’s endorsement.\n\n\nSince winning the gubernatorial election, Youngkin has signed a slew of conservative bills, including a ban on school mask mandates, pushed for a 15-week abortion ban and issued guidelines on transgender students in schools limiting bathroom and locker room use based on students’ sex at birth, which has been decried by LGBTQ advocates.\n\n\n\nYoungkin’s transgender policy, which also requires teachers to address students by their birth names, has drawn support from conservatives, with a lawsuit filed earlier this month by two mothers in Virginia Beach who argued a local school board failed to follow the policy and violated parents’ rights to “make basic decisions about the education and well-being of their children.”\n\n\nYoungkin was also courted by former Fox chair Rupert Murdoch on at least two occasions this year, the Washington Post reported, as Murdoch’s relationship with Trump soured in the wake of the 2020 election, with Murdoch asking Youngkin to run for the White House.\n\n\n\n\nNews Peg\nRepublican donors will reportedly meet next month at a Virginia Beach hotel in a closed-door retreat nicknamed the Red Vest Retreat—a nod to his iconic red vest donned during his gubernatorial campaign—to support a Youngkin presidential campaign, CBS News election correspondent Robert Costa in a Washington Post op-ed published Thursday afternoon. Officially, the meeting will focus on a push for full GOP control of the Virginia General Assembly. One billionaire GOP donor, Thomas Peterffy—the world’s 54th richest person with a net worth of $28 billion—told Costa he has already donated “millions of dollars” to Youngkin’s political action committee, saying he believes Younkin “appears to be leaving the door open.”\nWhat We Don’t Know\nWhether Youngkin will enter the race. Despite the speculation, Youngkin has sidestepped the question, saying this week he was “humbled” by the rumors but wants to focus on Virginia, a point he has reiterated throughout the 2020 election cycle.\nTangent\nA Youngkin presidential campaign would add the Virginia governor to a laundry list of GOP presidential hopefuls, though as of this week, no GOP candidate aside from Trump comes close to taking the lead in early primary polls, even as Trump faces four indictments and as he skips the first two GOP primary debates. Florida Gov. Ron DeSantis was previously favored by some top donors as a Trump alternative, but he has struggled in the polls and taken stances on Ukraine and business that alienated some former backers, causing heavyweights like billionaire Ken Griffin to back away. According to FiveThirtyEight’s weighted average, Trump is dominating the field with 54% of likely Republicans supporting him, over 13.8% for DeSantis and 6.3% for Vivek Ramaswamy and former South Carolina Gov. Nikki Haley.\nContra\nTrump went on a rant against Youngkin as rumors of a Youngkin presidential run began to circulate last year, taking credit for Youngkin’s rise to national prominence. Trump has taken a similar tack with a handful of other former allies, including DeSantis, a 2024 Trump rival whose rise he has repeatedly taken credit for. In a statement on Truth Social in November, Trump claimed he “got MAGA to Vote” for Youngkin,” arguing the governor would not have “come close to winning” otherwise and that he “knows that.”\nSurprising Fact\nYoungkin tip-toed around Trump’s baseless election fraud theories following Trump’s loss to President Joe Biden in 2020. He declined to answer a question on whether he would have voted to certify Trump’s 2020 loss if he had been in Congress on January 6, 2021, before ultimately saying he would have, and doubted Democrats would cheat in the 2021 gubernatorial election, even after Trump speculated about voter fraud with no evidence.\n\nFurther Reading\nAlarmed Republicans are preparing to draft Glenn Youngkin (Washington Post)\nRupert Murdoch Urged Glenn Youngkin To Run For President Against Trump, Report Says (Forbes)\nTrump Lashes Out At Gov. Glenn Youngkin With Racist Comment—Latest Republican Rival He’s Attacked After Election Disappointment (Forbes)\nSend me a secure tip. Brian BushardEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/brianbushard/2023/09/28/glenn-youngkin-buzz-heres-why-everyone-is-suddenly-talking-about-the-virginia-governor-as-a-trump-challenger/"}, {"title": "Tesla Sued By U.S. Agency For Discriminating Against Black Employees", "date": "2023-09-28", "content": "Updated Sep 28, 2023, 04:52pm EDTShare to FacebookShare to TwitterShare to LinkedinTopline\nThe U.S. Equal Employment Opportunity Commission sued Tesla, one of billionaire Elon Musk’s companies, Thursday, alleging the company has allowed “widespread and ongoing racial harassment of its Black employees” and retaliated against workers who opposed it for nearly a decade, violating the Civil Rights Act.\nTesla is facing a lawsuit from the U.S. Equal Employment Opportunity Commission over its treatment ... [+] of Black employees.Smith Collection/Gado/Getty Images\n\nKey Facts\n\n\nThe EEOC alleges in its suit that—from 2015 to present—Black employees at Tesla manufacturing facilities in Fremont, California, have “endured racial abuse, pervasive stereotyping and hostility,” saying racial slurs were casually tossed about and Black employees regularly encountered graffiti with “swastikas, threats and nooses” at work.\n\n\n\nThe suit also claims that people who objected to the environment were terminated, transferred or had a change in their duties.\n\n\n\nAccording to the suit, Tesla had “actual or constructive knowledge” of the racial harassment and “failed and refused to take steps to address” it, investigate complaints or enact policies to prevent it from happening.\n\n\n\n\nThe EEOC is seeking back pay for affected workers, compensatory and punitive damages and the court to order a change in Tesla’s employment practices to avoid a similar situation happening in the future.\n\n\nForbes has reached out to Tesla for comment.\n\n\n\n\nCrucial Quote\n“The racial misconduct was frequent, ongoing, inappropriate, unwelcome and occurred across all shifts, departments and positions,” the lawsuit states.\nContra\nTesla has not yet addressed the EEOC’s suit, but is facing a similar lawsuit by a California civil rights agency and has called that case “misguided.” “Attacking a company like Tesla that has done so much good for California should not be the overriding aim of a state agency with prosecutorial authority,” the February 2022 statement read.\n\nKey Background\nThis isn’t Tesla’s first lawsuit stemming from accusations of discrimination. Last year, a Black gay woman who had been a contract worker at a California factory sued Tesla, alleging the company didn’t address racial slurs, homophobic slurs or physical attacks against her. Tesla has also faced a suit from two female employees who filed lawsuits alleging the Fremont factory was a “hostile work environment” for female workers. Reuters reported Tesla is also facing a class action suit by workers at the Fremont location, but the company has denied that it did anything wrong.\nForbes Valuation\nWe estimate Musk to be worth $248.6 million as of Thursday afternoon, making him the richest person in the world.\n\nFurther ReadingBloombergBloombergReutersTesla sued by US agency over alleged harassment of Black factory workers\nFollow me on Twitter. Send me a secure tip. Molly BohannonEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/mollybohannon/2023/09/28/tesla-sued-by-us-agency-for-discriminating-against-black-employees/"}, {"title": "Trump’s New York Fraud Trial Will Start Monday, Court Says—After Judge Rules He Inflated His Assets", "date": "2023-09-28", "content": "Updated Sep 28, 2023, 04:44pm EDTShare to FacebookShare to TwitterShare to LinkedinTopline\n A sweeping lawsuit accusing former President Donald Trump of exaggerating his net worth by billions of dollars will go to trial in New York on Monday, an appeals court ruled Thursday, striking down Trump’s attempt to delay the trial just two days after a judge ruled that he defrauded lenders and ordered the dissolution of his New York-based businesses.\nFormer US President and 2024 presidential hopeful Donald Trump speaks at Drake Enterprises, an ... [+] automotive parts manufacturer and supplier, in Clinton, Michigan, on September 27, 2023. (Photo by MATTHEW HATCHER/AFP via Getty Images)AFP via Getty Images\n\nKey Facts\n\n\nNew York Attorney General Letitia James’ civil fraud case against Trump will go to trial on Monday, as scheduled, the state’s appellate court ruled Thursday.\n\n\n\nThe decision comes after Judge Arthur Engoron, who will preside over the trial, issued a partial judgment in the case Tuesday that validated a key component of James’ lawsuit: that Trump defrauded lenders by overinflating the value of his assets and overall net worth.\n\n\n\n\nEngoron’s order canceled business certificates for some of Trump’s New York-based companies and ordered a receiver to dissolve them.\n\n\n\nThe non-jury trial will address six other claims in the lawsuit — including conspiracy, falsifying business records and insurance fraud — and determine the outcome of additional penalties James’ office requested, including $250 million in damages, prohibiting Trump from engaging in commercial real estate acquisitions for five years and barring him and his children from serving as officers or directors in any New York business.\n\n\nTrump sued Engoron earlier this month and sought to delay the trial, alleging he ignored an earlier appeals court ruling that suggested the statute of limitations for some of the allegations against Trump may have expired—arguments the appeals court did not address in its Thursday ruling.\n\n\n\n\nChief Critic\nTrump ranted about the trial date in a Truth Social post Wednesday, claiming cases like his “take many years to go to trial” and alleging the suit is a “‘railroading’ job pushed hard by the Radical Left DOJ for purposing Election Interference.”\n\nWhat To Watch For\nThe dissolution of the Trump Organization’s New York-based entities is likely to take years to play out, and Trump’s legal team has already vowed to appeal the Engoron’s ruling, which does not affect LLCs encompassed by the Trump Organization that are based outside of New York.\n\nKey Background\nJames filed a lawsuit in September, 2022, accusing Trump, the Trump Organization, his children and two of his associates of overvaluing his assets by up to $3.6 billion in some years between 2011 and 2021, including by misstating the size of his properties, in order to secure more favorable loans and insurance policies. Engoron issued the Tuesday ruling after James’ office filed a motion—which Trump’s legal team opposed—seeking a summary judgment in the case, arguing a trial was unnecessary in order to find Trump guilty. Engoron wrote that Trump and his co-defendants were living in “a fantasy world, not the real world” when they lied about the size and worth of his properties, including Mar-A-Lago, his 40 Wall Street skyscraper in downtown Manhattan and estate in Westchester County, New York.\nFurther Reading\nDid Judge Kill The Trump Organization? What Fraud Ruling Means For Ex-President’s Business (Forbes)\nTrump Committed Fraud By Inflating His Assets, Judge Rules (Forbes)\nTrump Inflated Net Worth By $3.6 Billion, New York Attorney General Says (Forbes)\nFollow me on Twitter. Send me a secure tip. Sara DornEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/saradorn/2023/09/28/trumps-new-york-fraud-trial-will-start-monday-court-says-after-judge-rules-he-committed-fraud/"}, {"title": "Apple Asks Supreme Court To Overturn Ruling In Epic Games Legal Battle", "date": "2023-09-28", "content": "Share to FacebookShare to TwitterShare to LinkedinTopline\nApple asked the Supreme Court Thursday to overturn a previous judge's decision that it cannot forbid app developers — like Epic Games which sued over the policy — from using alternative payment methods for in-app purchases, according to a legal document obtained by Forbes—the latest in Apple’s feud with Epic Games, which is also asking the Supreme Court to review the case for different reasons.\nIn this photo illustration, Epic Games logo is seen on a smartphone screen and Apple logo in the ... [+] background. (Photo Illustration by Pavlo Gonchar/SOPA Images/LightRocket via Getty Images)SOPA Images/LightRocket via Getty Images\n\nKey Facts\n\n\nApple argued the lower court—the District Court for the Northern District of California—doesn't have the authority to make such a ruling.\n\n\n\nIt went on to point out that the Supreme Court, specifically Justices Neil Gorsuch, Clarence Thomas and Amy Coney Barrett, have opined that some courts are overstepping their bounds by making judgements that affect the entire country as opposed to their specific jurisdictions.\n\n\n\n\nApple also argued this kind of case brought forth by a single plaintiff, as opposed to a class action lawsuit, cannot have such a broad impact on the entirety of Apple's millions of app developers nationwide because only Epic Games sued and the court didn't prove all the other developers were harmed.\n\n\n\nIt also argued that since Epic Games and its products are no longer on the App Store, (Apple removed them from the store amidst the companies’ feuds over the policy in question) they no longer have standing to sue.\n\n\n\n\nKey Background\nThe two companies’ legal battle began in 2020 after Apple, maker of the iPhone, removed Epic Games, maker of Fortnite, from its App Store for giving a discount to players who used its own payments system rather than Apple’s App Store for in-game purchases—known as “anti-steering provisions.” Epic Games, which wants to avoid the 30% commission and circumvent Apple’s system, sued in a California federal court, arguing that Apple had a monopoly over mobile gaming. Specifically, Epic Games argued that Apple’s policies of forbidding third-party app marketplaces, charging a 30% commission on purchases through its own App Store, and these anti-steering provisions were a violation of U.S. antitrust laws. In 2021, after a trial, a federal judge sided with Apple on most of the claims, determining that it did not have a monopoly over mobile gaming and could continue forbidding third-party marketplaces and charging commission. However, the judge decided that Apple’s anti-steering provisions violated California state laws against unfair competition. That change has been put on hold, though, while the appeal process plays out. Epic Games and Apple both appealed the decision, hoping to each reverse the side of the ruling they lost, and a federal appeals court in San Francisco affirmed the lower court’s decision.\n\nTangent\nEpic Games also wants to see this case go before the Supreme Court. On Wednesday, the company filed its own petition to the Supreme Court requesting the court hear the case.\nWhat To Watch For\nThe Supreme Court could decide by January whether it is going to take up the case, per its regular schedule.\n\nFurther Reading\nFortnite Maker Asks Supreme Court To Review Apple Monopoly Ruling (Forbes)\nFollow me on Twitter or LinkedIn. Send me a secure tip. William SkipworthEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/willskipworth/2023/09/28/apple-asks-supreme-court-to-overturn-ruling-in-epic-games-legal-battle/"}, {"title": "Billionaire And Celebrity Real Estate: Here's Which Homes Hit The Market This Week", "date": "2023-09-28", "content": "Share to FacebookShare to TwitterShare to LinkedinTopline\nFrom Nashville to Hollywood, the celebrity real estate market is on a hot streak this week with the likes of Elton John, Cooper Kupp, and James Packer listing their multi-million-dollar mansions with amenities from wine cellars to saunas and theater rooms.\nA Beverly Hills estate owned by billionaire James Packer is listed for $85 million by agents ... [+] Santiago Arana of The Agency and Jade Mills of Caldwell Banker.Adrian van Anz\n\nKey Facts\n\n\nAustralian billionaire James Packer listed a sprawling Beverly Hills estate —previously occupied at different times by Danny DeVito, Jennifer Lopez and Ben Affleck — for $85 million—complete with 1.2 acres, 12 bedrooms, 17 bathrooms, a wood-paneled wine cellar, theater, cigar room, gym and sauna.\n\n\n\nIf the Lake Tahoe estate formerly owned by casino mogul and hotelier Steve Wynn on \"Billionaires' Row\" in Nevada sells for its $76 million asking price, it will be one of the most expensive real estate transactions ever in the area; the compound includes a 12,661-square-foot main residence, guest house, private peach and deep-water pier.\n\n\n\n\nRadio host and former American Idol mentor Bobby Bones dropped the price on his Nashville mansion to $8.7 million—$5 million more than what he paid for it three years ago but $500,000 less than it first listed for in September per Realtor.com—the sprawling home is ultra-modern and includes a renovated barn, pool, guest house and basketball court.\n\n\n\nThe Atlanta condo Sir Elton John has owned since the early 1990s and used as a home base for his U.S. tours is listed for sale at $4.995 million; the 13,500-square-foot home on the 36th floor of a condominium complex combined six units into one to include a gym, gallery space and massage room.\n\n\nLos Angeles Rams wide receiver Cooper Kupp is asking for $3.5 million for his family's five-bedroom home, guest house, barn-turned-training-facility and the 4 acres it sits on in Oregon—a million-dollar mark-up from when he purchased it in 2020, per the Wall Street Journal.\n\n\n\nJen Landon, known for her role as Teeter on hit Paramount show Yellowstone, listed her Venice Beach townhouse for $1.8 million, a purchase that comes with a two-car garage, bamboo floors, double-height ceiling and a roof terrace with mountain views.\n\nA Beverly Hills estate owned by billionaire James Packer is listed for $85 million by agents ... [+] Santiago Arana of The Agency and Jade Mills of Caldwell Banker.Adrian van AnzA wine cellar in the Beverly Hills estate owned by billionaire James Packer that is listed for $85 ... [+] million by agents Santiago Arana of The Agency and Jade Mills of Caldwell Banker.Adrian van Anz\n\n\nKey Background\nL.A.'s real estate market has been in flux since a new millionaires tax on luxury homes saw celebrities like Brad Pitt and Mark Wahlberg sell off their expensive properties before the April 1 deadline. The market was booming before the law went into effect—the first quarter of the year saw sales of $5 million homes shoot up 35% above average, real estate agents told the Hollywood Reporter—but the market chilled almost immediately after. Called Measure ULA, the new law adds an additional 4% tax to sales above $5 million and 5.5% for sales above $10 million. Luxury sales, defined as homes in the top 5% of market value, have plummeted nationwide, the Wall Street Journal reported, down 24% in the three months that ended June 30. Would-be buyers are grappling with historically high interest rates and concerns of a potential recession, while sellers in some areas seem to have pulled back on putting their homes in the market because of market conditions—WSJ reports a 17% drop in year-over-year in luxury listings.\nCrucial Quote\n“The flurry of activity that happened up until April 1 was pretty phenomenal,” real estate attorney Loretta Thompson told the Hollywood Reporter of the Measure ULA tax. “And then, of course, after that, people started pulling their listings.”Steve Wynn's Lake Tahoe estate. Miles Minno PhotographyThe grand salon of Sir Elton John's Atlanta condo. Bartolotti Media For Atlanta Fine Homes Sotheby's International Realty\nForbes Valuation\nJames Packer, the largest shareholder of Crown Resorts, is worth $2.5 billion and was the 1,199th richest person in the world as of Thursday. Steve Wynn, namesake of the Wynn hotel and casino chain, is worth $3.4 billion and landed at No. 855 on Forbes' real-time billionaires list Thursday. He resigned as chair of his company after sexual misconduct allegations surfaced in 2018.\nTangent\nGeorge Clooney recently denied reports he was selling his luxurious Lake Como home, part of an impressive real estate portfolio that includes a Los Angeles villa, English island property and the Domaine du Canadel estate in France. The Lake Como house, which he bought from the billionaire Heinz family in 2002, is worth more than $100 and would have landed among the top of celebrity real estate deals. Other owners of $100 million homes include Snapchat CEO Evan Spiegel and model Miranda Kerr, tech billionaire Larry Ellison, Microsoft founder Bill Games, Amazon creator Jeff Bezos and Oprah Winfrey.Radio host Bobby Bones has listed his Nashville home for $8.7 million. Realtor.comRadio host Bobby Bones has listed his Nashville home for $8.7 million. Realtor.comCooper Kupp's Oregon home is listed for $3.5 million. Justin Jones | Jones Media ShopCooper Kupp's Oregon home is listed for $3.5 million. Justin Jones | Jones Media Shop\n\nFurther Reading\nCasino Mogul Steve Wynn's Former Estate On Lake Tahoe Lists For $76 Million (Forbes)\nSir Elton John Lists Longtime Atlanta Home For Nearly $5 Million (Forbes)\nGeorge Clooney Denies Reports That $107 Million Lake Como Villa Is For Sale — Here’s What We Know (Forbes)\nFollow me on Twitter. Send me a secure tip. Mary Whitfill RoeloffsEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/maryroeloffs/2023/09/28/billionaire-and-celebrity-real-estate-heres-which-homes-hit-the-market-this-week/"}, {"title": "Gaetz Claims McCarthy Paid Social Media Influencers To Bash Him Online—But McCarthy Denies It", "date": "2023-09-28", "content": "Updated Sep 28, 2023, 04:18pm EDTShare to FacebookShare to TwitterShare to LinkedinTopline\nHard-right firebrand Rep. Matt Gaetz (R-Fla.) accused House Speaker Kevin McCarthy (R-Calif.) of paying social media influencers to drag him online, Gaetz told reporters Thursday, a claim vehemently denied by McCarthy—as Gaetz leads right-wing opposition to a McCarthy-backed budget proposal and threatens to oust McCarthy as speaker.\nFreak show: House Republican Leader Kevin McCarthy (R-Calif.) squares off with Rep. Matt Gaetz ... [+] (R-Fla.) in the House Chamber after Gaetz voted present during the fourth day of voting for Speaker of the House at the U.S. Capitol Building on January 6, 2023, in Washington, D.C.Chip Somodevilla/Getty Images\n\nKey Facts\n\n\nGaetz said McCarthy denied the unproven allegations when he confronted him during a closed-door Republican meeting on Thursday, telling CNN, “I asked him whether or not he was paying those influencers to post negative things about me online.”\n\n\n\nGaetz was referring to uncorroborated allegations that proliferated on social media earlier this week by users like the right-wing DC Draino account, which tweeted a screenshot of a message the account claimed was from a “McCarthy proxy” gauging interest in “paid posts” as part of an “advocacy campaign with [the]\n\n budget” involving “Gaetz and the government shutdown.” \n  \n\n\n\nMcCarthy’s spokesperson Drew Florio denied any involvement in what he referred to as an “influencer conspiracy theory” and claimed “all signs point to this Dem-backed company is behind what Gaetz is whining about,” linking to a tweet referencing Notorious LLC, which describes itself as “a global content studio and network that empowers bold voices everywhere.”\n\n\nMcCarthy’s outside legal counsel sent a cease-and-desist letter earlier this week to the entity, accusing it of “reaching out to social media influencers about a[n] ‘Against Gaetz and government shutdown’ [campaign] and claiming it is in on behalf of Speaker McCarthy,” according to a copy of the letter.\n\n\nWhen asked how McCarthy responded to Gaetz’s allegations during Thursday’s meeting, Florio pointed to a tweet from Punchbowl News’ Jake Sherman that cited a source in the room who said McCarthy told Gaetz, “I’m not worried about you,” and added that he donated $5 million to fellow GOP candidates.\n\n\nForbes has reached out to Gaetz’s offices and Notorious LLC for comment.\n\n\n\n\nCrucial Quote\n“We’ve done more legislating in the last 48 hours than we’ve done in the last eight months,” Gaetz told The Messenger about the budget negotiations. “And we’ve had to do it with a political gun to the speaker’s head.”\n\nKey Background\nGaetz has repeatedly threatened to file a motion that would kick-start the process to remove McCarthy as speaker, citing what he claims are violations of the agreement McCarthy reached with his hard-right detractors to win the speaker’s gavel in January. Gaetz has cited a string of demands of which he says McCarthy has fallen short, including passing a balanced budget and holding a vote on term limits for lawmakers. Gaetz amplified his threat earlier this month as budget negotiations heated up, delivering a speech on the House floor in which he accused McCarthy of being “out of compliance” with the agreement: “It’s put up or shut up time for McCarthy.” Gaetz is among a coalition of far-right House members who said they will vote against a McCarthy-backed continuing resolution that would keep the government up and running temporarily to give lawmakers more time to negotiate a full-year spending plan for fiscal year 2024.\nWhat To Watch For\nCongress must pass, and the president must sign, 12 annual appropriations bills that make up the government spending plan every year before the current fiscal year expires on September 30. With just two days left before a government shutdown, neither chamber has passed a budget or a temporary resolution to keep the government open past Saturday. Right-wing resistance in the GOP-controlled House has effectively halted budget negotiations as they can afford to lose just four Republican votes to pass any legislation without the support of Democrats. In addition to the Republicans who refuse to vote on any short-term legislation, a larger GOP coalition is united behind adding anti-immigration measures and border security funding to the budget—provisions the Democratic-controlled Senate has left out of the short-term spending plan it’s advanced in the upper chamber this week.\n\nFurther Reading\nFar-Right Gaetz Slams McCarthy Over ‘Baby Step’ Biden Impeachment Probe (Forbes)\nTrump Tells Republicans To Embrace A Government Shutdown To Place Blame On Biden (Forbes)\nHard Right Punishes McCarthy Over Debt Ceiling Deal: How The House Freedom Caucus Is Waging Mutiny (Forbes)\nFollow me on Twitter. Send me a secure tip. Sara DornEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/saradorn/2023/09/28/gaetz-claims-mccarthy-paid-social-media-influencers-to-bash-him-online-but-mccarthy-denies-it/"}, {"title": "Uber, DoorDash And Grubhub Must Pay $18 An Hour To NYC Delivery Workers, Judge Rules", "date": "2023-09-28", "content": "Updated Sep 28, 2023, 03:01pm EDTShare to FacebookShare to TwitterShare to LinkedinTopline\nNew York City delivery workers will start making at least $18 an hour after a judge denied an attempt from three food delivery giants to block a New York City minimum wage bill from going into effect—delivering a victory for supporters of the first-of-its-kind law, which is the latest effort to regulate how gig workers are paid.\nNew York City has some 60,000 food delivery workers. Tayfun Coskun/Anadolu Agency via Getty\n\nKey Facts\n\n\nOn Thursday, New York state Justice Nicholas Moyne dismissed Uber, DoorDash and Grubhub’s attempt to bar the city from implementing the rule—which mandates the companies pay food delivery workers a flat hourly rate of $17.96 or pay 50 cents a minute per delivery.\n\n\n\nMoyne did, however, exempt Relay Delivery, a small delivery service company that joined the suit, from Thursday’s ruling, after the company argued it would be put out of business with the cost increase from the legislation.\n\n\n\n\n\n\nKey Background\nThe law was scheduled to go into effect July 12, but legal challenges delayed its start. Earlier this summer, Moyne temporarily halted the law from going into effect and allowed Uber, DoorDash and Grubhub to make additional filings in the case. The food delivery companies argued the added costs of higher wages could pass on additional costs to customers and restaurants and ultimately hurt opportunities for workers. Meanwhile, New York City’s Department of Consumer and Worker Protection argued the law would give delivery workers “fair pay for their labor.” The legislation is one of many efforts nationwide to extend minimum pay rules and other job protections for gig workers, like those at Uber and DoorDash, who are typically independent contractors and exempt from many laws that apply to traditional employees. New York City’s legislation, along with efforts in other states like California and Minnesota, aim to fill that gap. Over the summer in Minneapolis, local officials launched an effort to grant Uber and Lyft more worker protects including giving drivers a minimum wage, but that effort was vetoed by the city’s mayor, Jacob Frey.\n\nBig Number\n60,000. That’s how many food delivery workers New York City has, according to the New York Times. Those workers are paid an average of about $11 an hour with tips and expenses, the Times reported.\nSurprising Fact\nThis is the country’s first minimum pay-rate for delivery workers, according to the Times.\n\nTangent\nAlso on Thursday, California Gov. Gavin Newsom signed a law ensuring fast food workers are paid at least $20 an hour. After the $4.50 increase from the state’s current rate, California now has the highest minimum wage of any state in the country.\n\nFurther Reading\nN.Y. Judge Halts Law That Would’ve Raised Minimum Wage For App-Based Delivery Drivers In NYC (Forbes)\nDoordash, Grubhub And Uber Eats Sue New York City Over Cap On Restaurant Fees (Forbes)\nSend me a secure tip. Ana FaguyEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/anafaguy/2023/09/28/uber-doordash-and-grubhub-must-pay-18-an-hour-to-nyc-delivery-workers-judge-rules/"}, {"title": "California Fast Food Workers Secure $20 Minimum Wage—Highest In The U.S.", "date": "2023-09-28", "content": "Updated Sep 28, 2023, 03:39pm EDTShare to FacebookShare to TwitterShare to LinkedinTopline\nDemocratic California Gov. Gavin Newsom signed a law Thursday that will ensure state fast food workers are paid at least $20 an hour, making it the highest minimum wage of any state in the country and a significant increase from California's current $15.50 rate, which has been scrutinized for falling well below the state’s living wage.\nThe law will apply to workers at chains with more than 60 locations nationwide. (AP Photo/Damian ... [+] Dovarganes)Copyright 2023 The Associated Press. All rights reserved\n\nKey Facts\n\n\nThe law will go into effect next April 1 and applies to restaurant workers at chains that have at least 60 locations nationwide.\n\n\n\nThe law also establishes a fast food council with the power to increase the wage by 3.5% each year through 2029 or the annual change in the consumer price index, whichever is lower.\n\n\n\nThe council will be made up of members representing the fast food industry, the workers’ side and one unaffiliated member of the public who will serve as chair.\n\n\n\n\nThe new minimum wage marks the end of a years-long battle between workers and the restaurant industry, which was preparing to spend more than $100 million fighting the bill, according to NBC.\n\n\n\n\nBig Number\nAbout 500,000. That’s the approximate number of employees the law will apply to, according to PBS.\nTangent\nAnother worker-specific law will go into effect in New York City after a judge on Thursday blocked Uber, DoorDash and GrubHub’s attempt to stop the city from implementing a $18 minimum wage for delivery workers.\n\nSurprising Fact\nWest Hollywood, California, has one of the highest minimum wages in the country at $19.08. The rate will be in effect until next June, when it will increase by the consumer price index adjustment.\nKey Background\nCalifornia’s fast food workers made an average of $16.60 per hour and an average wage of $34,530 as of last May, according to the U.S. Bureau of Labor Statistics. Although the rate is among the highest in the country, workers have taken issue with the gap between it and California’s living wage, which is $21.24 for one single adult or $43.44 for an adult with one child, according to MIT’s living wage calculator. California legislators passed a separate bill for healthcare workers this month that would bring the minimum wage to $25. If passed, the law won’t apply to doctors and nurses but will include those who do everything else at hospitals, dialysis clinics and other healthcare facilities, according to the Associated Press.\n\nFurther Reading\nCalifornia Gov. Gavin Newsom signs law to raise minimum wage for fast food workers to $20 per hour (AP)\nA fight between fast-food chains and unions in California is over, for now – what to know (NBC)\nFollow me on Twitter or LinkedIn. Send me a secure tip. Antonio Pequeño IVEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/antoniopequenoiv/2023/09/28/california-fast-food-workers-secure-20-minimum-wage-highest-in-the-us/"}, {"title": "United Airlines Enhancing Wheelchair Accessibility After Federal Complaint: Here’s What Will Change", "date": "2023-09-28", "content": "Share to FacebookShare to TwitterShare to LinkedinTopline\nUnited Airlines announced a number of steps it will take to improve travel experiences for people in wheelchairs as part of an agreement with the Department of Transportation after a complaint about the mishandling of a wheelchair on a United flight was investigated, marking the latest move by the Biden Administration to improve infrastructure accessibility.\nUnited Airlines planes sit on the runway at Newark Liberty International Airport on November 30, ... [+] 2021 in Newark, New Jersey. (Photo by Spencer Platt/Getty Images)Getty Images\n\nKey Facts\n\n\nUnited will soon offer a flight filter that will let people put in the dimensions of their chair and prioritize flight options on planes with cargo hold doors large enough to hold the chair, as part of an agreement with the transportation department.\n\n\n\nThe airline will also start refunding the difference of flight costs for customers who have to take a more expensive flight to accommodate their wheelchair, according to a release from United; the changes are expected to be implemented early next year.\n\n\n\n\nUnited will also conduct a test program at the George Bush Intercontinental Airport in Houston to explore different ways “to safely accommodate passengers waiting for loaner wheelchairs because of damage or delay to their personal wheelchairs during a flight.”\n\n\n\nThe agreement followed “a lengthy investigation by the department” into a disability complaint filed by Engracia Figueroa, who died after sustaining injuries from a loaner wheelchair when her custom wheelchair was “severely damaged” and became inoperable on a 2021 United Airlines flight, according to the lawsuit.\n\n\n\n\nBig Number\n150,000. That’s about how many wheelchairs United carried on flights in 2022, the company said. During the past four years, United and United Express carriers mishandled wheelchairs at a rate of 1.2%, making them third-best among domestic carriers tracked, according to the DOT agreement.\n\nKey Background\nFigueroa was an advocate for disability rights and was on her way home from lobbying Congress about disability rights in Washington, D.C. on a United flight, when her custom chair—valued at around $30,000—was ruined. The lawsuit filed on her behalf alleges she was forced to sit in a non-motorized courtesy wheelchair for hours, which supposedly reopened a wound and caused “muscle cramps and spasms.” In a filing from May, United disputed the liability and damages claims and that “any act or omission of United was the proximate cause of Decedent’s injuries or death.” The suit alleges United refused to pay for a replacement chair until Figueroa contacted her local senators and got them involved in filing a complaint, after which they agreed to get a chair but got it to her too late as her condition had worsened. She died on October 31, 2021, a little over three months after her United flight.\nTangent\nThe Biden Administration has taken a particular interest in improving infrastructure accessibility. In the last year, it awarded $686 million in funding to projects in nine states that will increase the number of rail stations meeting or exceeding ADA standards and invested in developing accessible electric vehicle charging stations, according to the White House.\n\nFurther ReadingReutersUnited Airlines agrees to improve flight access for wheelchair usersWSJUnited Airlines Agrees to Smooth Travel for Wheelchair Users\nFollow me on Twitter. Send me a secure tip. Molly BohannonEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/mollybohannon/2023/09/28/united-airlines-enhancing-wheelchair-accessibility-after-federal-complaint-heres-what-will-change/"}, {"title": "Hyundai And Kia Recall Over 3.3 Million Cars—Here’s What Drivers Should Know", "date": "2023-09-28", "content": "Updated Sep 28, 2023, 03:13pm EDTShare to FacebookShare to TwitterShare to LinkedinTopline\nHyundai and Kia recalled over 3.3 million of their 2010s model vehicles for fluid leaking issues that could spark engine compartment fires while parked or driving—encouraging owners to park outdoors and away from buildings in case of fire.\nHyundai and Kia, both of Hyundai Motor Group, have recalled over 3.3 million vehicles and are urging ... [+] owners of specific models to park outdoors and away from building structures.Raymond Boyd/Getty Images\n\nKey Facts\n\n\nHyundai and Kia, which only a month ago recalled vehicles over an oil pump that could catch fire, recalled more on Wednesday for their anti-lock brake systems—no crashes, fatalities or injuries have been reported.\n\n\n\nHyundai recalled 1,642,551 of its vehicles in the U.S. and 326,942 in Canada, company spokesperson Ira Gabriel told Forbes, due to concerns its anti-lock brake system could leak brake fluid—often indicated by smoking or a burning or melting odor from the car—and result in a fire.\n\n\n\n\nHyundai owners can continue driving their vehicles, but the company advises owners to park outside—and away from buildings. “Hyundai plans to notify owners to bring their vehicles to the nearest Hyundai dealership for replacement” of the anti-lock brake system fuse for free, Gabriel said.\n\n\n\nKia, which is owned by Hyundai Motor Group uses similar parts, decided to recall 1,730,192 vehicles, company spokesperson James Bell told Forbes, including all models with a hydraulic electronic control unit, a part of the anti-lock brake system that is similar to Hyundai’s after a months-long investigation into them was triggered by Hyundai fire concerns.\n\n\nBell shared a statement saying select impacted model owners will be instructed to bring their cars to a Kia dealer for a new fuse.\n\n\n\n\nKey Background\nThe recall announcement follows several other rounds of recalls by the South Korean auto manufacturers this year—some as early as last month. In August, both Hyundai and Kia recalled some 92,000 vehicles, including the Hyundai Elantra (2023), Hyundai Kona (2023), Hyundai Palisade (2023-24), Hyundai Sonata (2023), Hyundai Tucson (2023), Kia Seltos (2023-23), Kia Soul (2023) and Kia Sportage (2023), due to oil pumps that could overheat and catch fire. In March, they made a similar plea for owners to park outdoors and away from other cars, homes and buildings when they both recalled over 570,000 vehicles released between 2019 and as late as this year for fear they could catch fire, according to the National Highway Traffic Safety Administration. Kia, specifically, had to recall 188,912 of its 2021-23 Kia K5 models due to side curtain airbags potentially deploying improperly and causing injury during a crash.\n\nSurprising Fact\nAlong with a spate of car recalls, both Kia and Hyundai are being sued by the city of Chicago for allegedly not having specific security technology within their cars that the city says led to a car theft crisis. About 17 cities are suing the automakers for similar reasons, though they have pushed for a U.S. judge to reject them, claiming other factors like city policing policies and TikTok videos that teach people how to break in certain Kia and Hyundai models are to blame for the uptick in car theft, according to Reuters. \nTangent\nRecalled Hyundai models this week include the Accent (2012-15), Azera (2012-15), Elantra (2011-15), Elantra Coupe (2013-15), Equus (2014-15), Genesis Coupe (2011-15), Santa Fe (2013-15), Santa Fe Sport (2013), Sonata HEV (2011-15), Tucson (2010-13), Tucson Fuel Cell (2015), Veloster (2012-15) and Veracruz (2010-12). Kia has recalled the Cadenza (2014-16), Forte/Forte Koup (2011-13), K900 (2015-17), Optima (2010-15), Optima Hybrid (2011-13), Rio (2011-17), Rondo (2010), Sorento (2011-14), Soul (2011-13) and Sportage (2010-13).\n\nFurther Reading\nHyundai And Kia Recall Nearly 92,000 Vehicles For Oil Pump That Could Catch Fire (Forbes)\nKia Recalls Vehicles With Trunks That Could Trap People Inside (Forbes)\nAlmost 4 Million Kia Vehicles Could Have Explosive Airbag Inflators, Report Says (Forbes)\nChicago Sues Kia And Hyundai After Spate Of Car Thefts In The City And Nationwide (Forbes)\nFollow me on LinkedIn. Send me a secure tip. Darreonna DavisEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/darreonnadavis/2023/09/28/hyundai-and-kia-recall-over-33-million-cars-heres-what-drivers-should-know/"}, {"title": "Two Books Break Book Sales Records At Christie’s Auction — Here Are The Most Expensive Books Ever Sold", "date": "2023-09-28", "content": "Share to FacebookShare to TwitterShare to LinkedinTopline\nA pair of books by Agatha Christie and Arthur Conan Doyle once owned by English musician Charlie Watts broke individual records for the beloved authors at Christie's auction house in London Thursday, months after an 800-year-old copy of the Bible earned the title of the most expensive book ever sold.\nA copy of \"The Hound of the Baskervilles\" by Arthur Conan Doyle is auctioned off at Christie's in ... [+] London on Thursday, Sept. 28, 2023.Christie's Images LTD\n\nKey Facts\n\n\nThe Thirteen Problems by Agatha Christie sold for $63,968, breaking her personal record of a $50,641 copy of The ABC Murders, which sold two years ago.\n\n\n\nThe $226,555 sale of The Hound of the Baskervilles by Arthur Conan Doyle on Thursday set a new world auction record for a printed book by the renowned Sherlock Holmes creator, previously set at $201,600 when a copy of The Sign of Four sold in 2022.\n\n\n\n\nBoth books belonged to Rolling Stones drummer Charlie Watts, who died two years ago—Thursday was the first day of a two-part auction of his books and jazz memorabilia.\n\n\n\nThe market for rare books has taken on a new life as a “new generation” of book lovers have entered the market, Bruce McKinney, founder of the Rare Book Hub, told the New York Post last month.\n\n\nThe market for books at auction jumped to $1.15 billion in 2021, McKinney estimated, and rare works are selling for more than ever before.\n\n\nSpecialist Gretchen Hause told the Post that book sales at Hindman Auctions in Chicago were averaging about $750,000 when she joined 2017—she estimates that’s jumped to $5 million this year.\n\n\nBook enthusiasts in their 20s and 30s are making up more of the rare book market than ever before, the New York Times reported last year, and the Antiquarian Booksellers’ Association of America trade group has created a diversity initiative to encourage \"underrepresented groups in the world of book collecting\" to break into the market.\n\n\n\n\n\nCrucial Quote\n“The world of the archive is actually considered pretty hip,” Michael F. Suarez, the director of the Rare Book School at the University of Virginia, told NYT.\nThe Most Expensive Books Ever SoldTooled and embossed seventeeth-century clamshell box and leather binding of Leonardo's Codex ... [+] Leicester.   (Photo by Seth Joel/Corbis/VCG via Getty Images)Corbis/VCG via Getty Images\nDa Vinci’s Codex Leicester manuscript—Microsoft billionaire Bill Gates spent $30.8 million in 1994, the equivalent of $64.68 million today, on a notebook of Leonardo da Vinci called the Codex Leicester manuscript. Dating back to the 16th century, the work includes sketches, diagrams and early theories from da Vinci in his own print.The Codex Sassoon, the earliest most complete edition of the Hebrew Bible, is pictured on March 22, ... [+] 2023.AFP via Getty Images\nWorld’s Oldest Bible—A near-complete Hebrew Bible that could date back to the 9th Century, known as the Codex Sassoon, sold at auction in May for $38.1 million, which Sotheby's called the most valuable book ever sold, not adjusted for inflation. The book was bought as a gift for the ANU Museum of the Jewish People in Tel Aviv.An 1830, first edition of the Mormon scripture, \"Book of Mormon\" is displayed at the Church of Jesus ... [+] Christ of Latter-Day Saints Church History Library.Getty Images\nBook of Mormon—The Mormon Church of Jesus Christ of Latter Day Saints paid $35 million in 2017 for an early, hand-written copy of the Book of Mormon. The church purchased a printer's manuscript of the religious text, believed to have been engraved on golden plates in its original form, from the Community of Christ, entirely with donations, per Smithsonian Magazine.View of the Gospels of Henry the Lion and Matilda of England, once the most expensive book in the ... [+] world, in the Duke August Library in the Lessing City of Wolfenbüttel.dpa/picture alliance via Getty Images\nGospels of Henry the Lion—Considered one of the great examples of Romanesque illuminated manuscripts, the Gospels of Henry the Lion was made in the 12th century on commission for the German Duke of Saxony. Romanesque illumination added lavish decorations and illustrations to manuscripts and the practice flourished in Germany through the late 1000s and 1100s. The Gospels of Henry the Lion sold for $20.7 million in 1983.An original copy of the Magna Carta is on display at Sotheby's December 7, 2007 in New York City. Getty Images\nMagna Carta—A now 725-year-old copy of the Magna Carta, which put into writing that the King of England was not above the rule of law, sold at Sotheby’s for $21.3 million in 2007. It has been on display at the National Archives and Records Administration since 1988 and is the last remaining copy in the United States, Reuters reported at the time of the sale. It is only one of 17 copies known to exist.\nGospel of St. John — The oldest known still-intact book in Europe, known as the St. Cuthbert Gospel because it was preserved in the tomb of Saint Cuthbert of Lindisfarne, sold to the British Library in London for $14 million in 2012. The red-leather-bound copy of the Gospel of St. John dates back to the 7th century, per NPR.A Sotheby’s employee handles a copy the “Bay Psalm Book”, the first book printed in 1640.AFP via Getty Images\nBay Psalm Book—Believed to be the first book ever published in the United States, this book of psalms sold for $14.2 million in 2013, the Los Angeles Times reported. The Bay Psalm Book was published by the Puritan leaders of the Massachusetts Bay Colony in 1640.\nRothschild Prayerbook—Australian businessman Kerry Stokes, the 570th richest man in the world as of Thursday, bought the Rothschild Prayerbook for $13.6 million in 2014. The Flemish manuscript, which dates back to the 16th century, was confiscated by the Nazis and later returned by the German government.An illustration engraved by Robert Havell, Jr. and published in \"Birds of America\" by John James ... [+] Audubon.Corbis via Getty Images\nBirds of America—The most expensive non-religious text ever sold, this collection of observations and illustrations of birds by John James Audubon sold for $9.6 million in 2010. The large book, which features more than 400 hand-drawn illustrations at life size, was purchased by an anonymous buyer at Christie's and previously belonged to American businessman Carl Knobloch Jr.\n\nFurther Reading\nSotheby’s To Bring 25,000 Bottles From Billionaire Pierre Chen’s Grand Wine Collection To Auction (Forbes)\nPaul McCartney’s Guitar String Is Set To Sell At Auction For Thousands Of Dollars (Forbes)\n Freddie Mercury’s Grand Piano Sells For $2.1 Million At Record-Breaking Auction For Rock Legend’s Possessions (Forbes)\nFollow me on Twitter. Send me a secure tip. Mary Whitfill RoeloffsEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/maryroeloffs/2023/09/28/two-books-break-book-sales-records-at-christies-auction---here-are-the-most-expensive-books-ever-sold/"}, {"title": "Biden Impeachment Inquiry: GOP Witness Turley Admits There’s Not Enough Evidence To Impeach Biden—Yet", "date": "2023-09-28", "content": "Updated Sep 28, 2023, 02:36pm EDTShare to FacebookShare to TwitterShare to LinkedinTopline\nConstitutional law expert Jonathan Turley cast doubt on the merits of impeaching President Joe Biden during the first hearing in the GOP-led House Oversight Committee’s impeachment probe Thursday—but said the inquiry itself is merited.\nJonathan Turley testifies during a House Oversight Committee hearing regarding the impeachment of ... [+] President Biden on Capitol Hill on September 28, 2023, in Washington, D.C.Drew Angerer/Getty Images\n\nKey Facts\n\n\nTurley, who also served as a witness during impeachment hearings of former Presidents Donald Trump and Bill Clinton, said he does “not believe that the current evidence would support articles of impeachment” against Biden.\n\n\n\nThe law professor made the comments during the Oversight Committee’s first hearing since House Speaker Kevin McCarthy (R-Calif.) launched an impeachment inquiry earlier this month to probe whether Biden inappropriately used his influence to financially benefit himself or his family members.\n\n\n\n\nTurley told the committee the probe itself is warranted and “the House has passed the threshold for an impeachment inquiry into the conduct of President Biden,” saying, “The House needs to answer troubling questions” around allegations of corrupt conduct, and insufficient evidence at the start of a probe “is commonly the case in presidential impeachments.”\n\n\n\nTurley was one of three witnesses the GOP called to testify Thursday, along with forensic accountant Bruce Dubinsky and former assistant attorney general at the Justice Department’s tax division, Eileen O’Connor.\n\n\nTurley, a professor at George Washington University Law School who has been described as a civil libertarian, opposed the first impeachment of Trump, but supported Clinton’s impeachment.\n\n\n\n\nChief Critic\nRep. Jamie Raskin (D-Md.)—the Oversight Committee’s top Democrat—said Republicans are doing Trump’s bidding in launching the impeachment inquiry, accusing them of acting “like flying monkeys on a mission for the Wicked Witch of the West.” He added that the mountain of bank records Republicans have collected from Biden’s son Hunter Biden and other family members doesn’t show a “single dime” went to the president.\n\nKey Background\nMcCarthy, facing pressure from the hard-right wing of his conference, announced earlier this month that the House would formally open an impeachment probe into Biden, led by the Oversight, Judiciary and Ways and Means Committees. Republicans have claimed without solid evidence that Biden abused his powers to financially benefit himself and his family members, citing bank records that detail his son Hunter Biden’s foreign business dealings.\nTangent\nAmong the most explosive allegations Republicans have launched against Biden is an FBI whistle-blower’s claim that the president and his son accepted a bribe from an executive at the Ukrainian energy company Burisma in exchange for then vice president Biden to advocate for the ouster of then Ukrainian prosecutor Viktor Shokin, who Republicans have claimed was investigating Burisma. The claim is fraught with factual fallacies, however. The FBI has not verified the whistle-blower allegation, and a former Shokin official said Burisma was not under investigation at the time. What’s more is the U.S. was part of an international coalition pushing for Shokin’s dismissal over concerns he was not pursuing corruption cases.\n\nFurther Reading\nBiden Impeachment Inquiry: Here’s How The Process Could Play Out—And How It Could End (Forbes)\nBiden Impeachment Inquiry: All The Allegations Against The President Leveled By House GOP, Explained (Forbes)\nHouse GOP Launching Impeachment Inquiry Into Joe Biden, McCarthy Says (Forbes)\nFollow me on Twitter. Send me a secure tip. Sara DornEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/saradorn/2023/09/28/biden-impeachment-inquiry-gop-witness-turley-admits-theres-not-enough-evidence-to-impeach-biden-yet/"}, {"title": "Want The Job Covering Taylor Swift Or Beyoncé? About 1,000 Others Have Applied", "date": "2023-09-28", "content": "Share to FacebookShare to TwitterShare to LinkedinTopline\nAfter a “cruel summer” of tech and media company layoffs, nearly a thousand Taylor Swift and Beyoncé fans have shown interest in USA Today publisher Gannett’s job postings for reporters to cover the two pop stars full-time, with many flocking to TikTok to share details about their dream job.\nNearly a thousand Taylor Swift and Beyoncé fans have shown interest in Gannett's job postings for ... [+] reporter positions to cover both pop stars. (Photo by Mat Hayward/TAS23/Getty Images for TAS Rights Management)Getty Images for TAS Rights Management\n\nKey Facts\n\n\nGannett—the nation’s largest newspaper chain—posted both positions at USA TODAY and Nashville-based daily paper the Tennessean about two weeks ago, and fans of Taylor Swift and Beyoncé have jumped on the opportunity to show the news org they have what it takes to report on both Grammy Award-winning superstars.\n\n\n\nThe Wall Street Journal first reported Thursday that applicants included influencers, Emmy award-winning journalists and a White House reporter.\n\n\n\nThe remote positions seek candidates with five years of newsroom experience, in addition to having sufficient knowledge of pop culture and the effect both women have on society and the music industry.\n\n\n\n\nGannett chief communications officer Lark-Marie Antón told Forbes the network is committed “to providing our audience with the content they crave.”\n\n\n\n\nWhat We Don’t Know\nExactly how much the job will pay. Gannett posted a massive wage range, saying the job pays somewhere between $21.63 and $50.87 an hour. “Exact compensation may vary based on skills, experience, location, and union representation, if applicable,” the company noted.\nKey Background\nIt’s been a major year for Beyoncé Knowles-Carter and Taylor Swift. Beyoncé was the most nominated artist at the 2023 Grammys. With 28 total wins in her career, she has become the woman with the most Grammy awards of all time. The “Single Ladies” singer also made history with her Renaissance world tour, which brought in $127.6 million over 11 shows in July—the largest one-month sum for any singer since the mid-‘80s, according to Billboard. In addition to the success of her Eras tour, an upcoming film of the concert and an upcoming re-release of 1989, Swift has also had a busy year. The “Shake It Off” artist brought in $2.2 billion in North American ticket sales alone and is also reportedly earning over $8.5 million per month in streaming royalties for her three album re-releases, which she recorded again due to royalty and ownership disputes.\nForbes Valuation\nBoth women are on Forbes’ Self-Made Women of 2023 List, with Swift’s estimated net worth valued at $740 million and Beyoncé’s at $540 million.\n\nTangent\nOn TikTok, users have shared the job postings for both singer-songwriters, adding that this could be a prime opportunity to attend concerts that were otherwise difficult to find tickets for due to demand drastically exceeding supply—leading to steep price points. Fans struggled to nab Taylor Swift Eras tour resale tickets for an average of $1,619 on SeatGeek, while Beyoncé tickets ranged from $102 on the lower end to around $1,401 and up for BeyHive VIP packages, depending on the seat and venue. Prospective candidates spend hours on their applications to USA TODAY, with 24-year-old journalist Lexi Thompson telling the Journal she spent six hours creating her Legally Blonde-style application video. The two job postings also come at a peculiar time for Gannett, which experienced a mass exodus among senior and executive roles, in addition to multiple recent layoff rounds. Gannett’s workforce has shrunk 47% in the last three years, according to the NewsGuild, with hundreds of journalists walking off the job to demand higher wages and changes in leadership.\nCrucial Quote\n\"Reviewing these roles has not broken my soul, quite the contrary!” Nick Capaz, Gannett talent acquisition manager, told Forbes. “The end game is that we will have two incredible reporters creating joyful content for our audience.\"\nSurprising Fact\nMore than half of U.S. adults say they are fans of Taylor Swift, according to a Morning Consult survey published in March.\n\nFurther Reading\nListening to Taylor Swift in Prison (The New Yorker)\nThe Legacy Of Beyoncé  (Essence)\nMore Than Half Of U.S. Adults Say They’re Taylor Swift Fans, Survey Finds (Forbes)\nTaylor Swift, ‘Barbie’ and Beyoncé are unleashing the spending power of women (CNN)\nFollow me on Twitter. Check out my website. Send me a secure tip. Amanda FlorianEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/amandaflorian/2023/09/28/want-the-job-covering-taylor-swift-or-beyonce-about-1000-others-have-applied/"}, {"title": "US Football League And XFL Announce Intention To Merge—Create New Spring Football League", "date": "2023-09-28", "content": "Share to FacebookShare to TwitterShare to LinkedinTopline\nThe United States Football League and XFL announced Thursday that they intend to merge pending regulatory approval, as the rival spring football leagues backed by Fox Corporation and an ownership group that includes Dwayne Johnson, respectively, aim to create a new professional league as an alternative to the NFL.\nBoth leagues said a potential merger would establish “substantial capabilities and resources to ... [+] ensure future growth.”Getty Images\n\nKey Facts\n\n\nThe USFL and XFL announced in a joint statement Thursday they intended to merge to create a new league that will “establish best-in-class operations based on the most recent seasons of both leagues.”\n\n\n\nBoth leagues said a potential merger would provide professional spring football with “substantial capabilities and resources” that would “ensure future growth” while developing players, coaches and staff.\n\n\n\n\nAdditional details regarding the new league will be announced at a later date, according to the statement, which noted the merger would be “subject to customary regulatory approvals.”\n\n\n\nNeither the USFL nor the XFL immediately responded to requests for comment from Forbes.\n\n\n\n\nBig Number\n$60 million. That’s how much the XFL lost during its inaugural season this year, industry sources told Forbes. The league projected $100 million in revenue for the 2024 season.\nKey Background\nA possible merger between the USFL and XFL was reported last week by Axios, which noted that officials from both leagues hoped to combine before the 2024 season. The XFL was launched in 2001 as a joint venture between NBC and World Wrestling Entertainment, before the league was closed after its first season. Vince McMahon spent $200 million to launch the league again in 2020, though the effort was cut short after five weeks because of the pandemic. An ownership group that included Johnson, Dany Garcia and RedBird Capital Partners subsequently purchased the league for $23.5 million, including $8.5 million to settle previous XFL debt. The USFL launched in the early 1980s before folding in 1985, and was revived by Fox in 2022. The USFL’s viewership is slightly higher than the XFL’s, with games averaging 751,000 viewers on Fox, FS1, NBC and USA Network. The XFL averaged 627,000 viewers per game.\n\n\nFurther Reading\nDwayne ‘The Rock’ Johnson Says The XFL Will Succeed. Who Wants To Tell Him He’s Wrong? (Forbes)\nFollow me on Twitter. Send me a secure tip. Ty RoushEditorial StandardsPrintReprints & Permissions", "label": "Business", "link": "https://www.forbes.com/sites/tylerroush/2023/09/28/us-football-league-and-xfl-announce-intention-to-merge-create-new-spring-football-league/"}]